# Hands-on Lab: Using Views
- Create a View and show a selection of data for a given table
- Update a View to combine two or more tables in meaningful ways
- Drop a created View

The database used in this lab is a sample HR database. This HR database schema consists of five tables called EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS, and LOCATIONS. Each table has a few rows of sample data.

## Prepping the Notebook

In [ ]:
!pip install mysql-connector-python pymysql sqlalchemy ipython-sql

In [3]:
import sqlite3
import seaborn as sns
import pandas as pd
import prettytable
import matplotlib.pyplot as plt


prettytable.DEFAULT='DEFAULT'
%load_ext sql
%matplotlib inline

## Set Up Database and Tables

In [4]:
%sql mysql+pymysql://root:p00pface@localhost:3306/HR
%sql SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/HR
6 rows affected.

[('departments',),
 ('employees',),
 ('empsalary',),
 ('job_history',),
 ('jobs',),
 ('locations',)]

## Task 1: Create a View

In [5]:
%%sql
CREATE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;

SELECT * FROM EMPSALARY;

 * mysql+pymysql://root:***@localhost:3306/HR
(pymysql.err.OperationalError) (1050, "Table 'EMPSALARY' already exists")
[SQL: CREATE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## Task 2: Update a View

In [1]:
# In this exercise, you will update a View to combine two or more tables

In [7]:
%%sql
CREATE OR REPLACE VIEW EMPSALARY AS
SELECT EMP.EMP_ID, EMP.F_NAME, EMP.L_NAME, EMP.B_DATE, EMP.SEX,
J.JOB_TITLE, J.MIN_SALARY, J.MAX_SALARY
FROM EMPLOYEES EMP, JOBS J
WHERE EMP.JOB_ID = J.JOB_IDENT;

SELECT * FROM EMPSALARY;

 * mysql+pymysql://root:***@localhost:3306/HR
0 rows affected.
10 rows affected.

[('E1001', 'John', 'Thomas', datetime.date(1976, 9, 1), 'M', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('E1002', 'Alice', 'James', datetime.date(1972, 7, 31), 'F', 'Sr.Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('E1003', 'Steve', 'Wells', datetime.date(1980, 10, 8), 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1004', 'Santosh', 'Kumar', datetime.date(1985, 7, 20), 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1005', 'Ahmed', 'Hussain', datetime.date(1981, 4, 1), 'M', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('E1006', 'Nancy', 'Allen', datetime.date(1978, 6, 2), 'F', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('E1007', 'Mary', 'Thomas', datetime.date(1975, 5, 5), 'F', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1008', 'Bharath', 'Gupta', datetime.date(1985, 6, 5), 'M', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1009', 'Andrea', 'Jones', datetime.date(1990, 9, 7), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('E1010', 'Ann', 'Jacob', datetime.date(1982, 3, 30), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))]

## Task 3: Drop a View

In [8]:
%%sql
DROP VIEW EMPSALARY;

SELECT * FROM EMPSALARY;

 * mysql+pymysql://root:***@localhost:3306/HR
0 rows affected.
(pymysql.err.ProgrammingError) (1146, "Table 'hr.empsalary' doesn't exist")
[SQL: SELECT * FROM EMPSALARY;]
(Background on this error at: https://sqlalche.me/e/20/f405)

&nbsp;<br>
&nbsp;<br>
&nbsp;<br>

## Practice Problems

#### 1. Create a view “EMP_DEPT” which has the following information.

EMP_ID, FNAME, LNAME and DEP_ID from EMPLOYEES table

In [9]:
%%sql
CREATE OR REPLACE VIEW EMP_DEPT AS
SELECT EMP_ID, F_NAME, L_NAME, DEP_ID
FROM EMPLOYEES;

SELECT * FROM EMP_DEPT;

 * mysql+pymysql://root:***@localhost:3306/HR
0 rows affected.
10 rows affected.

[('E1001', 'John', 'Thomas', '2'),
 ('E1002', 'Alice', 'James', '5'),
 ('E1003', 'Steve', 'Wells', '5'),
 ('E1004', 'Santosh', 'Kumar', '5'),
 ('E1005', 'Ahmed', 'Hussain', '2'),
 ('E1006', 'Nancy', 'Allen', '2'),
 ('E1007', 'Mary', 'Thomas', '7'),
 ('E1008', 'Bharath', 'Gupta', '7'),
 ('E1009', 'Andrea', 'Jones', '7'),
 ('E1010', 'Ann', 'Jacob', '5')]

#### 2. Modify “EMP_DEPT” such that it displays Department names instead of Department IDs. For this, we need to combine information from EMPLOYEES and DEPARTMENTS as follows.
EMP_ID, FNAME, LNAME from EMPLOYEES table and
DEP_NAME from DEPARTMENTS table, combined over the columns DEP_ID and DEPT_ID_DEP.

In [10]:
%%sql
CREATE OR REPLACE VIEW EMP_DEPT AS
SELECT EMP.EMP_ID, EMP.F_NAME, EMP.L_NAME, DEPT.DEP_NAME
FROM EMPLOYEES EMP, DEPARTMENTS DEPT 
WHERE EMP.DEP_ID = DEPT.DEPT_ID_DEP;

SELECT * FROM EMP_DEPT;

 * mysql+pymysql://root:***@localhost:3306/HR
0 rows affected.
10 rows affected.

[('E1001', 'John', 'Thomas', 'Architect Group'),
 ('E1002', 'Alice', 'James', 'Software Group'),
 ('E1003', 'Steve', 'Wells', 'Software Group'),
 ('E1004', 'Santosh', 'Kumar', 'Software Group'),
 ('E1005', 'Ahmed', 'Hussain', 'Architect Group'),
 ('E1006', 'Nancy', 'Allen', 'Architect Group'),
 ('E1007', 'Mary', 'Thomas', 'Design Team'),
 ('E1008', 'Bharath', 'Gupta', 'Design Team'),
 ('E1009', 'Andrea', 'Jones', 'Design Team'),
 ('E1010', 'Ann', 'Jacob', 'Software Group')]

#### 3. Drop the view “EPM_DEPT”.

In [11]:
%%sql
DROP VIEW EMP_DEPT;

SELECT * FROM EMP_DEPT;

 * mysql+pymysql://root:***@localhost:3306/HR
0 rows affected.
(pymysql.err.ProgrammingError) (1146, "Table 'hr.emp_dept' doesn't exist")
[SQL: SELECT * FROM EMP_DEPT;]
(Background on this error at: https://sqlalche.me/e/20/f405)

&nbsp;<br>
&nbsp;<br>
&nbsp;<br>

### check connection and end it

In [12]:
%sql --connections

{'mysql+pymysql://root:***@localhost:3306/HR': <sql.connection.Connection at 0x245c4e06790>}

In [15]:
%sql --close mysql+pymysql://root:***@localhost:3306/HR

In [16]:
%sql --connections

{}